; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 524861 1 1 2 5 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared0 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
)
(:goal (and
	(have_image Star5 image1)
	(have_image Planet6 infrared0)
	(have_image Planet7 infrared0)
	(have_image Phenomenon8 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (turn_to satellite0 groundstation1 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 4
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 4
4. (turn_to satellite0 star5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star5)
   goals met: 0 of 4
5. (take_image satellite0 star5 instrument0 image1)
   added: (have_image star5 image1)
   goals met: 1 of 4
6. (turn_to satellite0 planet6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet6)
   goals met: 1 of 4
7. (take_image satellite0 planet6 instrument0 infrared0)
   added: (have_image planet6 infrared0)
   goals met: 2 of 4
8. (turn_to satellite0 phenomenon8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 4
9. (take_image satellite0 phenomenon8 instrument0 image1)
   added: (have_image phenomenon8 image1)
   goals met: 3 of 4
10. (turn_to satellite0 planet7 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet7)
   goals met: 3 of 4
11. (take_image satellite0 planet7 instrument0 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 4 of 4
